/*
 * @Author: un-hum 383418809@qq.com
 * @Date: 2023-03-14 15:23:59
 * @LastEditors: un-hum 383418809@qq.com
 * @LastEditTime: 2023-03-14 15:36:53
 * @FilePath: /nosgram/src/components/ChatInputBox/emoji.ts
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
export default [
  {
    type: "smiling",
    data: [
      "😀",
      "😃",
      "😄",
      "😁",
      "😆",
      "😅",
      "🤣",
      "😂",
      "🙂",
      "🙃",
      "🫠",
      "😉",
      "😊",
      "😇",
    ],
  },
  {
    type: "affection",
    data: ["🥰", "😍", "🤩", "😘", "😗", "😚", "😙", "☺", "🥲"],
  },
  {
    type: "tongue",
    data: ["😋", "😛", "😜", "🤪", "😝", "🤑"],
  },
  {
    type: "hand",
    data: ["🤗", "🤭", "🫢", "🫣", "🤫", "🤔", "🫡"],
  },
  {
    type: "neutral-skeptical",
    data: [
      "🤐",
      "🤨",
      "😐",
      "😑",
      "😶",
      "🫥",
      "😶‍🌫️",
      "😏",
      "😒",
      "🙄",
      "😬",
      "😮‍💨",
      "🤥",
    ],
  },
  {
    type: "sleepy",
    data: ["😌", "😔", "😪", "🤤", "😴"],
  },
  {
    type: "unwell",
    data: [
      "😷",
      "🤒",
      "🤕",
      "🤢",
      "🤮",
      "🤧",
      "🥵",
      "🥶",
      "🥴",
      "😵",
      "😵‍💫",
      "🤯",
    ],
  },
  {
    type: "hat",
    data: ["🤠", "🥳", "🥸"],
  },
  {
    type: "glasses",
    data: ["😎", "🤓", "🧐"],
  },
  {
    type: "concerned",
    data: [
      "😕",
      "🫤",
      "😟",
      "🙁",
      "☹",
      "😮",
      "😯",
      "😲",
      "😳",
      "🥺",
      "🥹",
      "😦",
      "😧",
      "😨",
      "😰",
      "😥",
      "😢",
      "😭",
      "😱",
      "😖",
      "😣",
      "😞",
      "😓",
      "😩",
      "😫",
      "🥱",
    ],
  },
  {
    type: "negative",
    data: ["😤", "😡", "😠", "🤬", "😈", "👿", "💀", "☠"],
  },
];
